app/Http/Controllers/IndexController.php


        }

        $venues = Venue::whereIn('id', $parents)->where('show_on_website', 'Si')
            ->orderBy('venuesorder', 'asc')
            ->get();
---
select * from `venues` where `id` in ('02i3m0000092sG9AAI', '02i3m0000092sG3AAI', '02i3m0000092sJSAAY', '02i3m0000092rzDAAQ', '02i3m00000D9DaPAAV', '02i3m0000092sIyAAI') and `show_on_website` = 'Si' order by `venuesorder` asc

                }
                else
                {
                    $subvenues = Venue::where('parent_id', '=', $venue->id)
                        ->where('show_on_website', 'Si')
                        ->get();
---
select * from `venues` where `parent_id` = '02i3m00000D9DaPAAV' and `show_on_website` = 'Si'